<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"57e9d8ef1f5556393bdd132eb3323c9f18ad58920d6aebd874eb88a6426cab07","plan_job_ref":"Job Write Terraform Plan to Pull Request #43 at https://github.com/hackforla/devops-security/actions/runs/9098907125","plan_out_hash":"4cab4aa452fcf5151840738e78707778d974bf0a23f50b975bbd2251fa563d29","plan_hash":"b55fe143528bf56a09d75a1b350aa197b8e0727b1219ee2abae2970bf86e02f4","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.iam_oidc_gha_incubator.aws_iam_openid_connect_provider.github_actions will be created
+   resource "aws_iam_openid_connect_provider" "github_actions" {
+       arn             = (known after apply)
+       client_id_list  = [
+           "sts.amazonaws.com",
        ]
+       id              = (known after apply)
+       tags_all        = (known after apply)
+       thumbprint_list = [
+           "1b511abead59c6ce207077c0bf0e0043b1382612",
        ]
+       url             = "https://token.actions.githubusercontent.com"
    }

  # module.iam_oidc_gha_incubator.aws_iam_role.github_actions_oidc will be created
+   resource "aws_iam_role" "github_actions_oidc" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "token.actions.githubusercontent.com:aud" = "*****************"
                            }
+                           StringLike   = {
+                               "token.actions.githubusercontent.com:sub" = "******************************************************"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::035866691871:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = [
+           "arn:aws:iam::aws:policy/AdministratorAccess",
        ]
+       max_session_duration  = 3600
+       name                  = "gha-incubator"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.iam_user_tylerthome.aws_iam_user.user will be created
+   resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "tyler.thome"
+       path          = "/"
+       tags          = {
+           "Access Level" = "1"
+           "Project"      = "home-unite-us"
        }
+       tags_all      = {
+           "Access Level" = "1"
+           "Project"      = "home-unite-us"
        }
+       unique_id     = (known after apply)
    }

  # module.iam_user_tylerthome.aws_iam_user_group_membership.user_group_membership will be created
+   resource "aws_iam_user_group_membership" "user_group_membership" {
+       groups = [
+           "read-only-group",
        ]
+       id     = (known after apply)
+       user   = "tyler.thome"
    }

  # module.iam_user_tylerthome.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "tyler.thome"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #43](https://github.com/hackforla/devops-security/actions/runs/9098907125)